```
DataFrame employees
+-------------+--------+
| Column Name | Type   |
+-------------+--------+
| name        | object |
| salary      | int    |
+-------------+--------+
A company intends to give its employees a pay rise.

Write a solution to modify the salary column by multiplying each salary by 2.

The result format is in the following example.



Example 1:

Input:
DataFrame employees
+---------+--------+
| name    | salary |
+---------+--------+
| Jack    | 19666  |
| Piper   | 74754  |
| Mia     | 62509  |
| Ulysses | 54866  |
+---------+--------+
Output:
+---------+--------+
| name    | salary |
+---------+--------+
| Jack    | 39332  |
| Piper   | 149508 |
| Mia     | 125018 |
| Ulysses | 109732 |
+---------+--------+
Explanation:
Every salary has been doubled.
```

In [1]:
import pandas as pd

## Test Case

In [2]:
data = [
    {"name": "Jack",    "salary": 19666},
    {"name": "Piper",   "salary": 74754},
    {"name": "Mia",     "salary": 62509},
    {"name": "Ulysses", "salary": 54866},
]

df = pd.DataFrame(data)

In [4]:
def modify_salary_column(employees: pd.DataFrame) -> pd.DataFrame:
    employees["salary"] = employees["salary"] * 2
    return employees

modify_salary_column(df)

      name  salary
0     Jack   78664
1    Piper  299016
2      Mia  250036
3  Ulysses  219464